; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	image3 - mode
	thermograph0 - mode
	image1 - mode
	thermograph2 - mode
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
	Phenomenon21 - direction
	Planet22 - direction
	Phenomenon23 - direction
	Planet24 - direction
	Star25 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image1)
	(supports instrument1 thermograph2)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph0)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 thermograph2)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star16)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument8 image3)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 image3)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 GroundStation3)
	(supports instrument10 image3)
	(calibration_target instrument10 GroundStation2)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star18)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 GroundStation0)
	(supports instrument12 thermograph0)
	(supports instrument12 image3)
	(calibration_target instrument12 GroundStation1)
	(supports instrument13 thermograph2)
	(supports instrument13 image1)
	(calibration_target instrument13 GroundStation1)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star18)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(pointing satellite3 Star25)
	(pointing satellite4 Planet8)
	(have_image Star5 thermograph0)
	(have_image Phenomenon6 thermograph2)
	(have_image Star7 thermograph0)
	(have_image Phenomenon9 image3)
	(have_image Phenomenon10 image3)
	(have_image Phenomenon11 image1)
	(have_image Planet12 thermograph2)
	(have_image Star13 thermograph2)
	(have_image Phenomenon14 image3)
	(have_image Star16 thermograph0)
	(have_image Star17 image1)
	(have_image Star18 image1)
	(have_image Star19 thermograph2)
	(have_image Planet20 image1)
	(have_image Phenomenon21 thermograph2)
	(have_image Planet22 thermograph0)
	(have_image Phenomenon23 thermograph0)
	(have_image Planet24 image1)
	(have_image Star25 thermograph2)
))

)

; plan
1. (switch_on instrument11 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument11)
   goals met: 0 of 22
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 22
3. (calibrate satellite2 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 0 of 22
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 22
5. (turn_to satellite4 groundstation0 star18)
   deleted: (pointing satellite4 star18)
   added: (pointing satellite4 groundstation0)
   goals met: 0 of 22
6. (calibrate satellite4 instrument11 groundstation0)
   added: (calibrated instrument11)
   goals met: 0 of 22
7. (turn_to satellite4 phenomenon23 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon23)
   goals met: 0 of 22
8. (take_image satellite4 phenomenon23 instrument11 thermograph0)
   added: (have_image phenomenon23 thermograph0)
   goals met: 1 of 22
9. (turn_to satellite4 planet22 phenomenon23)
   deleted: (pointing satellite4 phenomenon23)
   added: (pointing satellite4 planet22)
   goals met: 1 of 22
10. (take_image satellite4 planet22 instrument11 thermograph0)
   added: (have_image planet22 thermograph0)
   goals met: 2 of 22
11. (turn_to satellite4 planet8 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 planet8)
   goals met: 3 of 22
12. (turn_to satellite3 star25 star18)
   deleted: (pointing satellite3 star18)
   added: (pointing satellite3 star25)
   goals met: 4 of 22
13. (turn_to satellite2 phenomenon11 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon11)
   goals met: 4 of 22
14. (take_image satellite2 phenomenon11 instrument6 image1)
   added: (have_image phenomenon11 image1)
   goals met: 5 of 22
15. (turn_to satellite2 planet20 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet20)
   goals met: 5 of 22
16. (take_image satellite2 planet20 instrument6 image1)
   added: (have_image planet20 image1)
   goals met: 6 of 22
17. (turn_to satellite2 planet24 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 planet24)
   goals met: 6 of 22
18. (take_image satellite2 planet24 instrument6 image1)
   added: (have_image planet24 image1)
   goals met: 7 of 22
19. (turn_to satellite2 star17 planet24)
   deleted: (pointing satellite2 planet24)
   added: (pointing satellite2 star17)
   goals met: 7 of 22
20. (take_image satellite2 star17 instrument6 image1)
   added: (have_image star17 image1)
   goals met: 8 of 22
21. (turn_to satellite2 star18 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star18)
   goals met: 8 of 22
22. (take_image satellite2 star18 instrument6 image1)
   added: (have_image star18 image1)
   goals met: 9 of 22
23. (turn_to satellite0 groundstation0 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation0)
   goals met: 9 of 22
24. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 9 of 22
25. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   goals met: 10 of 22
26. (turn_to satellite4 star16 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star16)
   goals met: 9 of 22
27. (take_image satellite4 star16 instrument11 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 10 of 22
28. (turn_to satellite4 planet8 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 planet8)
   goals met: 11 of 22
29. (turn_to satellite4 star5 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star5)
   goals met: 10 of 22
30. (take_image satellite4 star5 instrument11 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 11 of 22
31. (turn_to satellite4 planet8 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 planet8)
   goals met: 12 of 22
32. (turn_to satellite4 star7 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star7)
   goals met: 11 of 22
33. (take_image satellite4 star7 instrument11 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 12 of 22
34. (turn_to satellite4 planet8 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 planet8)
   goals met: 13 of 22
35. (turn_to satellite0 phenomenon10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon10)
   goals met: 12 of 22
36. (take_image satellite0 phenomenon10 instrument1 image3)
   added: (have_image phenomenon10 image3)
   goals met: 13 of 22
37. (turn_to satellite0 groundstation2 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation2)
   goals met: 14 of 22
38. (turn_to satellite0 phenomenon14 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon14)
   goals met: 13 of 22
39. (take_image satellite0 phenomenon14 instrument1 image3)
   added: (have_image phenomenon14 image3)
   goals met: 14 of 22
40. (turn_to satellite0 groundstation2 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation2)
   goals met: 15 of 22
41. (turn_to satellite0 phenomenon21 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon21)
   goals met: 14 of 22
42. (take_image satellite0 phenomenon21 instrument1 thermograph2)
   added: (have_image phenomenon21 thermograph2)
   goals met: 15 of 22
43. (turn_to satellite0 groundstation2 phenomenon21)
   deleted: (pointing satellite0 phenomenon21)
   added: (pointing satellite0 groundstation2)
   goals met: 16 of 22
44. (turn_to satellite0 phenomenon6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon6)
   goals met: 15 of 22
45. (take_image satellite0 phenomenon6 instrument1 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 16 of 22
46. (turn_to satellite0 groundstation2 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation2)
   goals met: 17 of 22
47. (turn_to satellite0 phenomenon9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon9)
   goals met: 16 of 22
48. (take_image satellite0 phenomenon9 instrument1 image3)
   added: (have_image phenomenon9 image3)
   goals met: 17 of 22
49. (turn_to satellite0 groundstation2 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation2)
   goals met: 18 of 22
50. (turn_to satellite0 planet12 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet12)
   goals met: 17 of 22
51. (take_image satellite0 planet12 instrument1 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 18 of 22
52. (turn_to satellite0 groundstation2 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation2)
   goals met: 19 of 22
53. (turn_to satellite0 star13 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star13)
   goals met: 18 of 22
54. (take_image satellite0 star13 instrument1 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 19 of 22
55. (turn_to satellite0 groundstation2 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation2)
   goals met: 20 of 22
56. (turn_to satellite0 star19 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star19)
   goals met: 19 of 22
57. (take_image satellite0 star19 instrument1 thermograph2)
   added: (have_image star19 thermograph2)
   goals met: 20 of 22
58. (turn_to satellite0 groundstation2 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 groundstation2)
   goals met: 21 of 22
59. (turn_to satellite0 star25 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star25)
   goals met: 20 of 22
60. (take_image satellite0 star25 instrument1 thermograph2)
   added: (have_image star25 thermograph2)
   goals met: 21 of 22
61. (turn_to satellite0 groundstation2 star25)
   deleted: (pointing satellite0 star25)
   added: (pointing satellite0 groundstation2)
   goals met: 22 of 22
